{
  "education": [
    {
      "awards_achievements": [
        "Dean's List (2015)",
        "GPA: 3.4/4.0",
        "Top 10 in University of Alberta Programming Contest"
      ],
      "degree": "Bachelor of Computer Science",
      "department": "Department of Computing Science",
      "duration": "2015-2020",
      "school_name": "University university"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_HaotianZhu",
  "highlighted_projects": [
    {
      "description": "Lead with a 6-person team responsible for full-stack development of a responsive website for a startup event insurance company. Managed a team responsible for front-end delivery using React, including buildout of layout and colour schema. Engaged the SpringBoot back-end development team to integrate all front-end deliverables effectively. Produced a mobile-friendly website featuring social media authentication and online payment function. ",
      "name": "OWL Event Insurance Website"
    },
    {
      "description": "Collaborated with a team to develop an online instructional tool for use by instructors across the University. Initiated and lead the complex migration of the project from Python 2.7 to Python 3.0 to enable the integration of new features. Designed and coded the Restful API in Django Restful Framework and integrated the React front-end project.",
      "git_url": "https://github.com/rw-moore/SciLO",
      "name": "Online Learning Web Application"
    },
    {
      "description": "Developed a single page application using Nodejs, Mongoose and Angular7. Deepened technical skills through the independent development of an anime forum and the site's deployment on Azure Cloud. Implemented the dynamic loading contents when customers scroll the page down. Demonstrated willingness to learn and gain proficiency with web technologies. ",
      "git_url": "https://github.com/haotianzhu/Moonback-reborn",
      "name": "Independent Website Development"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Developed bash scripts to deploy PostgreSQL database with docker. Developed SQL script to automatically insert Linux server hardware information into the database. Developed a bash agent program that automatically parses hardware specifications and real-time hard usage data, which is persisted into the PostgreSQL database. It allows the Jarvis Linux Cluster Administration team to track and manage a Linux cluster.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": [
        "Twitter App: Developed a Java application that allows users to create, fetch, and delete Tweets by Twitter API. Designed the project structure and data structure to store the tweet object using MVC pattern and Java Spring framework. Implemented Restful APIs and applied unit and integration tests to them. And then dockerize the program via docker file and deployed it to the server.",
        "JDBC App: Developed a Java program that CRUD a customer and order database. Designed and coded Java components to store the table information.",
        "Grep App: Implemented a Linux grep program in Java, which allows users to research and find all text patterns recursively within a given folder and write all match text lines in an output text file. Optimized codes by using Java Stream API and lambda. And Deployed the program as a docker image, and users can run this project by docker commands."
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    },
    {
      "description": "Developed an online trading simulation platform using SpringBoot and microservice architecture. Designed the layer structure and Java components with MVC pattern and spring framework. Implemented Restful APIs to allow the customers to buy and sell stocks and remotely call the IEXCloud server to update stock market information. Coded integration and unit tests using Junit and Mockito libraries and applied those tests for Restful APIs. Programmed docker files to dockerize and deploy the back-end application and database separately. ",
      "git_url": "/springboot",
      "name": "Springboot App"
    },
    {
      "description": "Data analytics on Sales data via using Python, JupyterNotebook, Pandas, NumPy, Matplotlib and so on. The project contains two parts, the data warehouse and notebook. Docker deploys them both separately. The JupyterNotebook analytics and visualize the monthly growth and the distribution of different customers. Also, used RFM and segmentations to the group and tag customers to analyze the target group and digging some potential marketing.",
      "git_url": "/python_data_anlytics",
      "name": "Python Data Analytics"
    },
    {
      "description": "Collected and inserted big data into different Hadoop cluster tables in the google cloud platform. Used Apache Hive and Zeppelin Notebook to help the data analytics team to solve business problems. Used different parsing strategies to create tables from GCP and HDFS to test the performance. Also used partition to index data and used parquet to stored data to improve the query performance. ",
      "git_url": "/hadoop",
      "name": "Hadoop"
    }
  ],
  "name": "Haotian Zhu",
  "others": [
    {
      "bullets": [
        "2nd Dota2 part in University of Alberta eSports club competition",
        "billiard player",
        "LeetCode problem-solving and posting solutions"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Worked in an agile environment using scums and implemented different projects and tickets.",
      "duration": "2020-present",
      "title": "Software Developer"
    },
    {
      "company": "University of Alberta",
      "description": "Worked in an agile environment and collaborated with teams responsible for priorities, including API design, testing/debugging, and development.",
      "duration": "2018-2019",
      "title": "Software Developer"
    },
    {
      "company": "University of Alberta",
      "description": "tutored advanced database course. Concepts include writing and optimizing SQL queries, B and B+ tree structures, and different database indexes, locks, etc.",
      "duration": "2018",
      "title": "Tutor"
    }
  ],
  "skills": {
    "competent": [
      "HTML5",
      "CSS",
      "React",
      "Postman",
      "Docker",
      "CI/CD"
    ],
    "familiar": [
      "Azure Cloud/Heroku Cloud",
      "Express.js",
      "Angular7",
      "MongoDB",
      "Jquery"
    ],
    "proficient": [
      "Java",
      "Python",
      "JavaScript",
      "Django",
      "Linux/Bash",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Git"
    ]
  },
  "summary": "I am Haotian Zhu, who graduated from the University of Alberta in 2020.  I am a versatile software application developer with a passion for learning and delivering on applications with a high-quality standard. I was working on campus as a full-stack developer. My primary responsibility was to develop a restful back-end API and do integrate tests with the front-end. I currently work on Jarvis as a software developer. I have experience using Django, Nodejs, and SpringBoot for the back-end; meanwhile, I am familiar with Reactjs, MongoDB and PostgreSQL. I am a team-oriented person, and I am also a problem solver. I enjoy coding challenges and learning algorithms and data structures.  Currently, I am looking for a great team to provide my skills and learn new tech skills."
}
